<a href="https://colab.research.google.com/github/CodeVerse-team/python-for-data-analysis-learning-libraries/blob/main/Pandas%20Learnings.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Pandas Learnings

In [2]:
import pandas as pd
import numpy as np

## Pandas Series
we'll start analyzing "The Group of Seven". Which is a political formed by Canada, France, Germany, Italy, Japan, The United States. We'll start by analyzing population, for that, we'll use a `pandas.series` Object

In [3]:
# In millions
g7_pop = pd.Series([35.467, 63.951, 80.940, 60.665, 127.061, 64.511, 318.523])

In [4]:
g7_pop

0     35.467
1     63.951
2     80.940
3     60.665
4    127.061
5     64.511
6    318.523
dtype: float64

Someone might not know we're representing population in millions of inhabitants. Series can have a `name`, to better document the purpose of the Series.

In [5]:
g7_pop.name = 'G7 Population in Millions'

In [6]:
g7_pop

0     35.467
1     63.951
2     80.940
3     60.665
4    127.061
5     64.511
6    318.523
Name: G7 Population in Millions, dtype: float64

In [7]:
g7_pop.values

array([ 35.467,  63.951,  80.94 ,  60.665, 127.061,  64.511, 318.523])

They're actually backed by numpy arrays:

In [8]:
type(g7_pop.values)

numpy.ndarray

and they look like simple python lists or Numpy arrays, but they're actually more similar to Python `Dictionaries`.

A Series has an `index`, that's similar to the automatic index assigned to Python's Lists:

In [9]:
g7_pop

0     35.467
1     63.951
2     80.940
3     60.665
4    127.061
5     64.511
6    318.523
Name: G7 Population in Millions, dtype: float64

In [10]:
g7_pop[0], g7_pop[1], g7_pop[3] #In Pandas Series too we can select the paticular element by their index no.

(np.float64(35.467), np.float64(63.951), np.float64(60.665))

In [11]:
g7_pop.index #using index function we can visit the numberings from the start to end in a Pandas Series.

RangeIndex(start=0, stop=7, step=1)

Also Using Index function we can assign particular indexes to the series in the variable of g7_pop

In [12]:
g7_pop.index = [
    'Canada',
    'France',
    'Germany',
    'Italy',
    'Japan',
    'United Kingdom',
    'United States',
]

In [13]:
g7_pop

Canada             35.467
France             63.951
Germany            80.940
Italy              60.665
Japan             127.061
United Kingdom     64.511
United States     318.523
Name: G7 Population in Millions, dtype: float64

Comparing it with the following table:



---



![image.png]()

We Can say that Series look like "ordered Dictionaries". We can actually create Series out of dictionaries.

In [14]:
pd.Series({
    'Canada': 35.467,
    'France': 63.951,
    'Germany': 80.94,
    'Italy': 60.665,
    'Japan': 127.061,
    'United Kingdom': 64.511,
    'United States': 318.523
}, name='G7 Population in millions')

Canada             35.467
France             63.951
Germany            80.940
Italy              60.665
Japan             127.061
United Kingdom     64.511
United States     318.523
Name: G7 Population in millions, dtype: float64

In [15]:
pd.Series(
    [35.467, 63.951, 80.94, 60.665, 127.061, 64.511, 318.523],
    index=['Canada', 'France', 'Germany', 'Italy', 'Japan', 'United Kingdom',
       'United States'],
    name='G7 Population in millions')

Canada             35.467
France             63.951
Germany            80.940
Italy              60.665
Japan             127.061
United Kingdom     64.511
United States     318.523
Name: G7 Population in millions, dtype: float64

You can also create Series out of other series, specifying indexes:

In [16]:
pd.Series(g7_pop, index=['France', 'Germany', 'Italy', 'Spain'])

France     63.951
Germany    80.940
Italy      60.665
Spain         NaN
Name: G7 Population in Millions, dtype: float64

# Index

Indexing works similarly to lists and dictionaries, you use the Index of the element you're looking for:

In [17]:
g7_pop

Canada             35.467
France             63.951
Germany            80.940
Italy              60.665
Japan             127.061
United Kingdom     64.511
United States     318.523
Name: G7 Population in Millions, dtype: float64

In [18]:
g7_pop['Canada'], g7_pop['Japan']

(np.float64(35.467), np.float64(127.061))

Numeric Positions can also be used, with the `iloc` attribute: {iloc} ➡ Interger Location

In [19]:
g7_pop.iloc[0], g7_pop.iloc[-1]

(np.float64(35.467), np.float64(318.523))

Selecting multiple elements at once

In [20]:
g7_pop[['Canada', 'France']]

Canada    35.467
France    63.951
Name: G7 Population in Millions, dtype: float64

In [21]:
g7_pop.iloc[[2, 4]]

Germany     80.940
Japan      127.061
Name: G7 Population in Millions, dtype: float64

Slicing also works, but **important**, in Pandas, the upper limit also included:

In [22]:
g7_pop['Canada': "Italy"]

Canada     35.467
France     63.951
Germany    80.940
Italy      60.665
Name: G7 Population in Millions, dtype: float64

In [23]:
l = ['a', 'b', 'c', 'd']
l

['a', 'b', 'c', 'd']

In [24]:
l[:2]

['a', 'b']

In [25]:
g7_pop

Canada             35.467
France             63.951
Germany            80.940
Italy              60.665
Japan             127.061
United Kingdom     64.511
United States     318.523
Name: G7 Population in Millions, dtype: float64

#Conditional Selection (Boolean arrays)

The Same boolean array technique was saw applied to numpy arrays can be used for Pandas `Series` :

In [28]:
g7_pop, g7_pop > 70

(Canada             35.467
 France             63.951
 Germany            80.940
 Italy              60.665
 Japan             127.061
 United Kingdom     64.511
 United States     318.523
 Name: G7 Population in Millions, dtype: float64,
 Canada            False
 France            False
 Germany            True
 Italy             False
 Japan              True
 United Kingdom    False
 United States      True
 Name: G7 Population in Millions, dtype: bool)

In [27]:
g7_pop > 70

Canada            False
France            False
Germany            True
Italy             False
Japan              True
United Kingdom    False
United States      True
Name: G7 Population in Millions, dtype: bool

In [31]:
g7_pop[g7_pop > 70] # This only shows the values that has a value above 70 in a seperate table.

Germany           80.940
Japan            127.061
United States    318.523
Name: G7 Population in Millions, dtype: float64

In [32]:
g7_pop.mean()

np.float64(107.30257142857144)

In [34]:
g7_pop[g7_pop > g7_pop.mean()] # This shows only a table of where the g7_pop is greater than it's mean.

Japan            127.061
United States    318.523
Name: G7 Population in Millions, dtype: float64

In [35]:
g7_pop.std()

97.24996987121581

In [36]:
g7_pop[(g7_pop > g7_pop.mean() - g7_pop.std() / 2) | (g7_pop > g7_pop.mean() + g7_pop.std() / 2)]

# BOOLEAN VALUES
# ~ not
# | or
# & and

France             63.951
Germany            80.940
Italy              60.665
Japan             127.061
United Kingdom     64.511
United States     318.523
Name: G7 Population in Millions, dtype: float64

# Operations and Methods

Series also support vectorized operations and aggregation functions as Numpy:

In [37]:
g7_pop

Canada             35.467
France             63.951
Germany            80.940
Italy              60.665
Japan             127.061
United Kingdom     64.511
United States     318.523
Name: G7 Population in Millions, dtype: float64

In [38]:
g7_pop * 1_000_000,

Canada             35467000.0
France             63951000.0
Germany            80940000.0
Italy              60665000.0
Japan             127061000.0
United Kingdom     64511000.0
United States     318523000.0
Name: G7 Population in Millions, dtype: float64

In [39]:
g7_pop.mean()

np.float64(107.30257142857144)

In [40]:
np.log(g7_pop)

Canada            3.568603
France            4.158117
Germany           4.393708
Italy             4.105367
Japan             4.844667
United Kingdom    4.166836
United States     5.763695
Name: G7 Population in Millions, dtype: float64

In [41]:
g7_pop['France': 'Italy'].mean()

np.float64(68.51866666666666)

# Boolean Arrays
(Work in the same way as numpy)

In [42]:
g7_pop

Canada             35.467
France             63.951
Germany            80.940
Italy              60.665
Japan             127.061
United Kingdom     64.511
United States     318.523
Name: G7 Population in Millions, dtype: float64

In [49]:
g7_pop > 80, g7_pop[g7_pop > 80]

(Canada            False
 France            False
 Germany            True
 Italy             False
 Japan              True
 United Kingdom    False
 United States      True
 Name: G7 Population in Millions, dtype: bool,
 Germany           80.940
 Japan            127.061
 United States    318.523
 Name: G7 Population in Millions, dtype: float64)

In [50]:
g7_pop[(g7_pop > 80) | (g7_pop < 40)]

Canada            35.467
Germany           80.940
Japan            127.061
United States    318.523
Name: G7 Population in Millions, dtype: float64

In [52]:
g7_pop[(g7_pop > 80) & (g7_pop < 200)]

Germany     80.940
Japan      127.061
Name: G7 Population in Millions, dtype: float64

# Modifying Series

In [53]:
g7_pop['Canada'] = 40.5 # here, we are modifying the value using index, we can do it using sequential precision as below

In [54]:
g7_pop

Canada             40.500
France             63.951
Germany            80.940
Italy              60.665
Japan             127.061
United Kingdom     64.511
United States     318.523
Name: G7 Population in Millions, dtype: float64

In [63]:
g7_pop.iloc[-1] = 500

In [64]:
g7_pop

Canada             99.990
France             99.990
Germany            80.940
Italy              99.990
Japan             127.061
United Kingdom     99.990
United States     500.000
Name: G7 Population in Millions, dtype: float64

In [67]:
g7_pop[g7_pop < 70] = 99.99 # here modifying the values which are below 70 to be changed as 99.99.

In [66]:
g7_pop

Canada             99.990
France             99.990
Germany            80.940
Italy              99.990
Japan             127.061
United Kingdom     99.990
United States     500.000
Name: G7 Population in Millions, dtype: float64

# Pandas Series Exercises given by FreeCodeCamp

---
➡ Import Numpy and Pandas

In [126]:
import numpy as np
import pandas as pd
print(pd.__version__)

2.2.2

# Series Creation
➡ Create an empty pandas Series

In [72]:
pd.Series()

Series([], dtype: object)

➡ Given the X pyton list convert it to an Y pandas Series

` X = ['A', 'B', 'C'] `

In [78]:
x = ['A', 'B', 'C']
print(x, type(x))

['A', 'B', 'C'] <class 'list'>

In [79]:
y = pd.Series(x)

In [80]:
print(Y, type(Y)) # Changed into Pandas Series from list

0    A
1    B
2    C
dtype: object <class 'pandas.core.series.Series'>

➡ Given the y pandas Series, name it 'My Letters'

In [86]:
y.name = 'My Letters'
y

0    A
1    B
2    C
Name: My Letters, dtype: object

➡ Given the y pandas Series, show its values

In [88]:
y = pd.Series(['A', 'B', 'C', 'D', 'E'])

y.values

array(['A', 'B', 'C', 'D', 'E'], dtype=object)

# Series indexation
➡ Assign index names to the given X pandas Series

In [93]:
x = pd.Series(['A', 'B', 'A', 'B'])

index_names = ['first', 'second', 'third', 'fourth']
x.index = index_names
x

first     A
second    B
third     A
fourth    B
dtype: object

➡ Given the X pandas Series, show its first element

In [97]:
x.index[0], x.iloc[0], x['first']

('first', 'A', 'A')

➡ Given the X pandas Series, show its last element

In [98]:
x.index[-1], x.iloc[-1], x['fourth']

('fourth', 'B', 'B')

➡ Given the X pandas Series, show all middle elements

In [111]:
x.iloc[1:-1]

second    B
third     A
fourth    B
fifth     A
Sixth     B
dtype: object

➡ Given the X pandas Series, show the elements in reverse position

In [115]:
x.iloc[::-1] # by putting '::' this symbol 2x it shows a series in a reverse order.

sixth     B
Sixth     B
fifth     A
fourth    B
third     A
second    B
first     A
dtype: object

➡ Given the X pandas Series, show the first and last elements

In [119]:
x.iloc[[0, -1]]

first    A
sixth    B
dtype: object

# Series manipulation
➡ Convert the given integer pandas Series to float

In [134]:
X = pd.Series([1,2,3,4,5],
              index=['first','second','third','forth','fifth'])

pd.Series(X, dtype= float)

first     1.0
second    2.0
third     3.0
forth     4.0
fifth     5.0
dtype: float64

➡ Reverse the given pandas Series (first element becomes last)

In [135]:
X[::-1]

fifth     5
forth     4
third     3
second    2
first     1
dtype: int64

➡ Order (sort) the given pandas Series

In [137]:
X.sort_values()
X

first     1
second    2
third     3
forth     4
fifth     5
dtype: int64

➡ Given the X pandas Series, set the fifth element equal to 10

In [142]:
X.iloc[4] = 10
X

first      1
second     2
third      3
forth      4
fifth     10
dtype: int64

➡ Given the X pandas Series, change all the middle elements to 0

In [147]:
X.iloc[1:-1] = 0
X

first     10
second     0
third      0
forth      0
fifth     10
dtype: int64

# Series boolean arrays (also called masks)
➡ Given the pandas Series, make a mask showing negative elements

In [149]:
notSeries = pd.Series([-1,2,0,-4,5,6,0,0,-9,10])

In [156]:
mask1 = notSeries <= -1
mask2 = notSeries <= 0
mask1, mask2

(0     True
 1    False
 2    False
 3     True
 4    False
 5    False
 6    False
 7    False
 8     True
 9    False
 dtype: bool,
 0     True
 1    False
 2     True
 3     True
 4    False
 5    False
 6     True
 7     True
 8     True
 9    False
 dtype: bool)

mask = notSeries <= -1